[{"originalPostURL":"https://sourwolfsam.tumblr.com/post/136619957028","postBodyContent":"\n                                                                        <p><b>Gryffindors</b> are bright mornings, leaves dripping in gold. They’re the trailblazers, unafraid of the road ahead. They’re laughing so loud your stomach hurts, the knowledge that your friends are right behind you wherever you go. They’re ice skating with someone you love, clinging on to them for dear life. They’re make-believe games with quests and dragons and swords pointing at the sky. They’re rosy cheeks, winter winds and freezing hands. They’re the adrenaline when a plane takes off, the drop at the top of a rollercoaster. They’re delighted screams and freedom, the wind through your hair. They’re panting, pillow fights, feathers bursting into the air. They’re finger painting and festivals and burning sunsets. They’re the burn in your lung after chasing something you’ll never be able to catch.&nbsp;</p><p><b>Hufflepuffs</b> are honey and flowers and the soft autumn sun. They’re knitted jumpers and scarves and soft tan boots. They’re fresh air and nature, the sound of birds singing. They’re rolling down a hill in the spring, grass stains on your knees, daisy chains in your hair. They’re waving at someone across a crowded room, bright smiles and laughter. They’re coming home after a long day and seeing your family. They’re playing fetch with your dog, your cat weaving between your feet. They’re fluffy socks and song birds and kraft notebooks with hand drawn patterns. They’re throw cushions on a bed, a tiny cottage surrounded by wilderness. They’re the ground beneath your feet, the air that you breathe. They’re the light you chase when you thought you’d never see the morning.&nbsp;<br></p><p><b></b><b>Ravenclaws</b> are leather bound books and overstocked libraries. They’re waking up at two am to google that thing that’s bugging you. They’re journals with half the words crossed out, scribbles and ink stains and missing pages. They’re stretching when you’ve been hunched over all day, rolling off the edge of a bed, burrowing in blankets. They’re torch light and held breaths and reverent whispers. They’re the entire night sky and everything beyond it; the embodiment of the universe. They’re desperate searches and hidden castles and ghost stories by firelight. They’re the mystery of a dark corridor, the force of a whirlwind. They’re the excitement of discovery, the rustle of crunched up paper. They’re the last whisper before you fall asleep.&nbsp;</p><p><b>Slytherins</b> are foggy hillsides and picturesque landscapes. They’re hand written love notes and subtle glances across a classroom. They’re black boots, long coats, buttons done up to the top. They’re tipping your head back to breathe the air, kicking up stones on a deserted path. They’re mirrored lakes, everything below the surface. They’re the confidence to get something right, the feel of magic in your fingertips. They’re holding your breath underwater, pretending to be a mermaid when you swim. They’re finding that one song that makes you want to create a storm. They’re the chill in the breeze, the force in the tide. They’re enchanted forests and lingering glances and long drives. They’re the lightning and the thunder and everything in between.&nbsp;</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784633584664576/sourwolfsam-gryffindors-are-bright-mornings"},{"originalPostURL":"https://donoteattheyellowsnow.tumblr.com/post/162416926948","postBodyContent":"\n                                                                    <p><i>“You know what, my friend? It’s time to be chill for real.”</i></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784624489283584/donoteattheyellowsnow-you-know-what-my-friend"},{"originalPostURL":"https://steverogesr.tumblr.com/post/163549342418","postBodyContent":"\n                                                                    <p><small><i>The price of freedom is high. It always has been. And it’s a price I’m willing to pay. And if I’m the only one, then so be it. But I’m willing to bet I’m not.</i></small><br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784619294687232/steverogesr-the-price-of-freedom-is-high-it"},{"originalPostURL":"https://stileslydias.tumblr.com/post/159425399697","postBodyContent":"\n                                                                    <p><small><a href=\"http://stileslydias.tumblr.com/tagged/stydiaedit\">W</a>hen I kissed him… <b><i>That’s when it all changed.</i>&nbsp;</b>(<a href=\"http://scottstiles.tumblr.com/post/158715028019/memories-found-insp\">insp</a>)</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784615238795264/stileslydias-when-i-kissed-him-thats-when-it"},{"originalPostURL":"https://tomfordvelvetorchid.tumblr.com/post/162836122829","postBodyContent":"\n                                                                        <p>I literally don’t get the appeal of being outside like its fuckin hot and theres bugs like…hard pass</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784605839294464/tomfordvelvetorchid-i-literally-dont-get-the"},{"originalPostURL":"https://starsville.tumblr.com/post/163125651509","postBodyContent":"\n                                                                    <p></p><blockquote><p><a href=\"http://starsville.tumblr.com/tagged/cm\">character moodboard:</a> rey</p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784594494849024/starsville-character-moodboard-rey"},{"originalPostURL":"https://emmaawatson.tumblr.com/post/159493466051","postBodyContent":"\n                                                                    <p></p><blockquote><p><sup><a href=\"https://www.tumblr.com/tagged/rebelcaptainweek\"><b>Rebelcaptain Appreciation Week</b></a>: Day #3 - \nTropes</sup><br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784591740141568/emmaawatson-rebelcaptain-appreciation-week-day"},{"originalPostUsername":"guiltygirl","postBodyContent":"\n                                                                        <p>someone: hey do you wanna hang out </p><p>me: i can’t bro i’m uglier than usual today</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784588981436417/guiltygirl-someone-hey-do-you-wanna-hang-out"},{"originalPostUsername":"ianmckllen","postBodyContent":"\n                                                                    <p><small>We create our own demons.<br></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784586241441792/ianmckllen-we-create-our-own-demons"},{"originalPostUsername":"coffeebooknerd","postBodyContent":"\n                                                                        <p>a concept: my tbr is only a pile 5 or 6 books tops. I only buy books as I read them. I never feel behind on a series. I keep up on my goal # of classics per year. No reading slumps. 2 books min a month easily. Each book in a series is increasingly better with zero character inconsistencies and plot/theme cohesiveness that concludes in a beautiful arc. There is lots of representation and diversity and I have zero problematic faves cause none of them are problematic. People always return books I lend them. I have plenty of room on my bookshelves. I am happy. I am calm. And all. the damn. covers. match.</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718784583484768256/coffeebooknerd-a-concept-my-tbr-is-only-a-pile"}]