[{"originalPostURL":"https://reshille.tumblr.com/post/164223012582","postBodyContent":"\n                                                                    <p>I examine the gun that we shared.<br>Philip never hurt a soul. He must have been so scared.<br><br>Please listen to the edited Hamilton song ‘Ten things One thing’ if you haven’t heard of it yet. It broke my already damaged heart.<br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600528148905984/reshille-i-examine-the-gun-that-we-shared-philip"},{"originalPostURL":"https://studyblr.tumblr.com/post/168897251824","postBodyContent":"\n                                                                        <p></p><h1>tag yourself student edition</h1><p>who cares: reads books in class instead of listening, attention span of 5 seconds when studying, generally starts studying in the day before, lost all their new fancy pens by week 2, still somehow gets A*, sometimes starts arguing with the teacher </p><p>i can and i will: motivated af, watches legally blonde 24/7, big dreams and aspirations, bullet journal is goals, sometimes very forgetful but makes up for it through very hard work, wants to figure out everything by themselves before asking for help</p><p>hello my name is stressed: signed up for 10000 extracurriculars and can’t get out of them now, time management god, hates the glorification of all-nighters but stays up until 6 am anyway, has the highest expectations regarding themselves, needs a hug</p><p>aesthetics TM: desperately wants their notes to look perfect, spends all their money on stationery, loves to doodle, PUNS, is great in one specific class, always tries to help their friends with homework, study playlists!!!, can still easily feel overwhelmed and lost but they try and that’s enough </p><p>what: has lost their motivation somewhere along the way, has no idea what’s going on, “there was homework”, messy notes and messy life, really wants school to end, hates the education system, has no idea what they want to do after school tho </p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600525391167488/tag-yourself-student-edition"},{"originalPostURL":"https://winchstrs.tumblr.com/post/168960585213","postBodyContent":"\n                                                                    <p>Happy 31st Birthday, Christopher Catesby “Kit” Harington! ♡ <b><i>(December 26th, 1986)</i></b></p><p>“I was lying down for so many hours for two whole episodes. I fell asleep in the middle of a scene and woke up, and you know when you wake up you don’t quite know where you are? There’s nothing scarier than waking up in the middle of Game of Thrones world – naked and everyone standing over you – and you go, <i>‘oh my God, I’ve died and I’ve actually ended up in Westeros.’</i>”</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600522648043520/winchstrs-happy-31st-birthday-christopher"},{"originalPostURL":"https://rosegoldenmoon.tumblr.com/post/168941684987","postBodyContent":"\n                                                                        <p></p><h2><b><a href=\"https://href.li/?https://thoughtcatalog.com/brianna-wiest/2017/12/what-you-were-supposed-to-learn-between-2016-and-2018-based-on-your-zodiac-sign/\">what you were supposed to learn between 2016 and 2018</a></b></h2><p><i>apply with rising sign.</i></p><h2>ARIES</h2><blockquote><p><b>2016: </b>You were supposed to differentiate what you want from what you think the world wants from you. This was a year of self-discovery, one that had you challenging and questioning a lot of things that you’d previously been accepting as fact. You did a lot of soul-searching this year, and came out on the other end with some pivotal realizations.</p><p><b>2017:</b> You were supposed to dive off the high board. When you knew what needed to change you went for it – and probably head first. This was the year in which you experienced radical change and saw a world that was beyond what you’d ever conceived of before. All of this new understanding brought a change in perspective, and a welcome one at that.</p><p><b>2018:</b> This is the year you decide what you want to do from here on out. This is the year that you get clear on some of the big, lingering question marks that still exist in your life. You’ll regain your clarity and focus in work and in love, and you’ll get ready to start deepening those roots come 2019.</p></blockquote><h2>TAURUS</h2><blockquote><p><b>2016:</b> You were supposed to reinvent something. Whether that was a home remodel, a career shift, or even just a reconsideration of who your innermost friend group is, what really changed this year was your self-image. There were parts of yourself you’ve needed to accept for a long time, and other parts of your potential that had been latent until now. This was the year to do what had not been done before.</p><p><b>2017:</b> You were supposed to learn boundaries. Yes, you’re a social creature (even if you’re inherently introverted, Tauruses thrive in their “tribe”). Despite this, 2017 was a year to learn what it means to say “no,” what it means to speak up when you need to speak up, what it means to not fear being disliked in favor of exhausting yourself to the point of total depletion.</p><p><b>2018: </b>This is the year the tides turn for the shore. After so many months of uncertainty, newness and soul-searching, this is the year that you start to find some reprieve. Venus is center stage all year long, and your personal relationships and business ventures receive sparkling luck because of it.</p></blockquote><h2>GEMINI</h2><blockquote><p><b>2016: </b>You were supposed to embrace changes at home. This year ruled everything with your closest family members, and this was a time for you to confront new challenges with vigor and to find within them grace. You’d spent the last few years very much focused on yourself and your work, but something drew your attention to what really matters: giving your time and energy to those closest to you.</p><p><b>2017:</b> You were supposed to see who your real friends are. You’d spent so much of the last few years trying to cater to people who sometimes didn’t seem like they really cared all that much in return, and 2017 brought complete clarity as to who you should really be spending your time with. This was a year to make amends, reinvent your social calendar, and redistribute your time and energy to people and things that brought you joy in return.</p><p><b>2018: </b>You are supposed to embrace that project you’ve been dreaming of forever. With everything starting to settle into a new kind of normalcy on the homefront, this year will be all about stepping past your comfort zone and building something for yourself. There’s a reason you’d been feeling so much stagnancy and discomfort at times – something was telling you that you’re meant to do greater things than you can currently conceive of. This is the year to take the first step.</p></blockquote><h2>CANCER</h2><blockquote><p><b>2016:</b> You were supposed to let this year surprise you. This was a time of unexpected advancement for you, and some of the choices you made then would leave lasting impressions on your life for many years to come. You gained clarity and a degree of maturity you didn’t even realize you were missing. This was the year that you started to get clear on what – or who – you really want in your life.</p><p><b>2017: </b>This was the year you were supposed to run, not walk, toward your goals. This was the year that you started living out your ambitions every single day. Gone are the days of pipe dreams just existing in your mind. Whether it was committing to newfound responsibility, routine, or even just making more time for what you claim to value, this was the year you challenged yourself.</p><p><b>2018: </b>You are supposed to let love in. It doesn’t matter if you’re single or happily betrothed, this is the year that love takes center stage for you. Whether it is friendships, your closest romantic relationship or even just self-love, this is the year that you re-prioritize what you thought mattered and make sure that your life is focused on what really matters: the people you love, the things you love, and the work that you love, as much as you’re able to love it.</p></blockquote><h2>LEO</h2><blockquote><p><b>2016:</b> You were supposed to let go of the plan. At this point in your life, you had to accept that though things didn’t go as you once thought they would, that doesn’t mean they aren’t going well. Though it comforts you to adhere to your idea of “what’s next,” sometimes, the best thing you can do is see where life takes you. Usually, the things you lose are for your best interest anyway.</p><p><b>2017: </b>You were supposed to find yourself again. The low blows of 2016 took a toll on your self-confidence, which is a rare thing for you to experience. However, it set you up to find a whole new degree of self-confidence and assuredness within yourself. If you could survive the past year, you can survive anything.</p><p><b>2018: </b>You’re supposed to go where you’ve never been before. They say that the true definition of idiocy is doing the same thing over and over and expecting different results. This year, that will be put to the test for you. You’re meant to expand your borders, date new people, try new things… you may just find that there’s a whole lot of joy waiting for you in life, if only you’d open up and give it a chance.</p></blockquote><h2>VIRGO</h2><blockquote><p><b>2016: </b>You were supposed to cut loose ends. This was the year that you had to come face to face with what wasn’t working in your life – lest it be forcefully removed from you first.</p><p><b>2017: </b>You were supposed to pursue a new dream. This was the year that you embarked on a new, long-awaited adventure, whether it was a new relationship, the next level of your career, or perhaps even travel. This was the year in which you were supposed to take risks, and see firsthand what works and what doesn’t for your life.</p><p><b>2018: </b>You are supposed to make some firm decisions. After the past two years of an intense tug of war between what you think should be working and what you know isn’t, this is the year to ride or die. You will either start to soar and thrive like you never have before, or come to terms with having tried something new, even if it wasn’t supposed to be forever.</p></blockquote><h2>LIBRA</h2><blockquote><p><b>2016:</b> You were supposed to learn how to plant seeds. The past few years have been nothing short of radical for you, and it all began with your emerald Jupiter year in 2016 lighting the way for you to start making connections – perhaps with partners, employers or even with your inner self – that would come to fruition over the next few years.</p><p><b>2017: </b>You were supposed to realize how you were holding yourself back. This year was all about letting those seeds start to sprout, and identifying the ways in which you were stomping on your garden before you gave it a chance to grow.</p><p><b>2018:</b> You are supposed to learn how to let your garden feed you. This year is about finishing up what began in 2016, and allowing yourself to thrive in it. It is about making serious relationship commitments, becoming more financially stable than ever, and adjusting to your highest vision of yourself – because deep down, that’s who you’ve been all along.</p></blockquote><h2>SCORPIO</h2><blockquote><p><b>2016:</b> You were supposed to learn how to see for yourself. Despite being particularly self-assured and confident – even standoffish at times – you’re almost overwhelmingly swayed by what you think other people think. This was the year to start believing in your power more than your doubt; to start honoring what you feel, not what others believe.</p><p><b>2017:</b> You were supposed to embrace the feelings you’d been shoving away for so long. This year was all about confronting the emotions that you had been trying to avoid. Of course, it is all with purpose: next year is going to be about your renewal, and so to know what you want, you usually must first identify what you don’t.</p><p><b>2018:</b> You’re supposed to start new. With Jupiter touring your sun sign for most of the year, it is your time to build the life of your dreams. The relationships, jobs, challenges and choices you make now will leave you with (positive) repercussions for many, many years to come.</p></blockquote><h2>SAGITTARIUS</h2><blockquote><p><b>2016:</b> You were supposed to learn what it means to reconcile. This was the year that you had to look face first at what you think you’ve failed at, the relationships that had deteriorated over the years, and the ways in which you need to improve your wellbeing. This year likely brought you to many distant lands and into the arms of people you’d never expected. This was a year of mind, body and spirit exploration. You were supposed to come out on the other end with a greater sense of clarity.</p><p><b>2017: </b>You were supposed to learn how to reconnect. Whether it was a sick parent who you needed to stay at the bedside of, or a cousin who you’d regrettably lost contact with over the years, or even a friend who you’d always think about but never make plans with, this was a year that you opened your heart back up, and let the right people in… however slowly you had to do it.</p><p><b>2018: </b>You are supposed to make significant change in your life this year. Whether this means finally moving, changing careers like you’ve known you had to for so long, or just re-adjusting your daily routine to be more sustainable, this is the year in which any unstable bridges will collapse. This is for the best – you’d been hanging on by a thread for far too long. Besides, greener pastures await.</p></blockquote><h2>CAPRICORN</h2><blockquote><p><b>2016:</b> You were supposed to learn how to have vision. Despite being strong-minded, Caps are known for being malleable, if not gullible. They easily adopt other people’s ideals as their own, and this was the year to break out of that. It was time for you to learn how to think and feel autonomously, and the chances that succeeded those revelations seemed nothing short of miraculous.</p><p><b>2017: </b>You were supposed to get clarity on what’s not working. This was the year that didn’t hold back: you saw what doors were closed, you saw people’s true colors and intentions, you saw which business ventures were becoming fruitful and which weren’t. You couldn’t fool yourself if you tried to this year, the only question was how long it would take for you to finally choose to pivot.</p><p><b>2018:</b> You are supposed to start a journey into the unknown. This is a year in which you will do things you’ve never done before, perhaps live in or visit places you’ve never been, try work you’ve never done. This is the year that you will surprise yourself with your capability, and you will see all your past regrets dissolve now that you are truly living for your own best interest, not your preoccupation with someone else.</p></blockquote><h2>AQUARIUS</h2><blockquote><p><b>2016: </b>You were supposed to learn patience. Some years are revolutionary, some are stationary, some just… are. This year was the latter for you, as things seemed to move slowly, if at all. Little did you know then, the gears were turning, it was all just happening beneath the hood (so to say).</p><p><b>2017:</b> You were supposed to learn how to trust. This is a year that bridged the status of your life between 2016 and 2018, and it was built entirely on trusting people. Letting others into your sacred vision for business, love or life is not easy, but it is crucial. This year, you started to open up to potential you hadn’t recognized before, whether that was dating someone outside of your norm, or letting other people take on more responsibility at your job. Either way, it worked out for the best.</p><p><b>2018: </b>You are supposed to learn how to coexist, and co-work, better than ever before. You’ve learned over the past few years that teamwork makes the dream work (ha, but seriously, it does). Therefore, it’s in your best interest to be the best partner and in some cases, boss, that you can be. This means honing in on your empathy, your compassion, and at times, your selflessness, all while holding true to a greater vision. It’s a challenge, but the rewards will be invaluable.</p></blockquote><h2>PISCES</h2><blockquote><p><b>2016:</b> You were supposed to look into your past, and feel into your depths. This was a year in which some of your darkest traumas peeked their way out of the closet and said hi again. Of course, this was not so you’d needlessly suffer, but so that you’d see them for what they are – harmless ghosts in the closet – and resolve that you can move on.</p><p><b>2017:</b> You were supposed to find passion again. Over the past few years, if you’ve been less than thrilled with life it’s because you’ve felt your passions were suppressed by the weight of responsibility and loss. This is the year you rediscovered what you really love, or noticed that maybe you made a wrong choice with a move, a job, or a personal life decision. Either way, it’s not too late to turn around, or in some cases, keep running toward the horizon.</p><p><b>2018: </b>You are supposed to change your life – for good. With all of the evidence you’ve gathered over the past few years, now is the time to take action. You know where you want to go, the challenge is only whether or not you will be fearless enough to let yourself do it. </p></blockquote>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600519843151872/rosegoldenmoon-what-you-were-supposed-to-learn"},{"originalPostURL":"https://captainheroism.tumblr.com/post/147420950685","postBodyContent":"\n                                                                    <p></p><blockquote><p><small><b><a href=\"http://ironstarkasm.tumblr.com/tagged/marvelreq\">marvel requests</a> </b>| asked by owwfeels <i>&nbsp;</i>→ loki<br></small></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600517119934464/captainheroism-marvel-requests-asked-by"},{"originalPostURL":"https://daisyjonhson.tumblr.com/post/131229445006","postBodyContent":"\n                                                                    <p><small><b><a href=\"http://daisyjonhson.tumblr.com/tagged/gtkmm\">get to know me meme:</a></b>&nbsp;favorite pairings [1/?]→ Scott x Allison (Teen Wolf)</small></p><p><small>Why’d you do that?\n<i><b>Because I love you.</b></i></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600514354855936/daisyjonhson-get-to-know-me-meme-favorite"},{"originalPostURL":"https://kylos.tumblr.com/post/168578189702","postBodyContent":"\n                                                                    <p><small>me managing my emotions</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600511633866752/kylos-me-managing-my-emotions"},{"originalPostUsername":"crankmurphy","postBodyContent":"\n                                                                    <p><b><a href=\"http://crankmurphy.tumblr.com/tagged/make-me-choose\">MAKE ME CHOOSE</a>&nbsp;</b></p><p>↳<a href=\"http://greenieteresa.tumblr.com\">greenieteresa</a>&nbsp;asked&nbsp;<strike>will poulter or&nbsp;</strike>thomas brodie Sangster</p><p><a href=\"http://sarcasm-olala.tumblr.com\">↳sarcasm-olala</a>&nbsp;asked &nbsp;<strike>dylanO'Brien or</strike> Thomas Brodie-Sangster</p><p>↳<a href=\"http://icelovesfire.tumblr.com\">icelovesfire</a>&nbsp;asked&nbsp;<strike>jenna coleman or&nbsp;</strike>thomas sangster?</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600508902359040/crankmurphy-make-me-choose"},{"originalPostUsername":"simplypotterheads","postBodyContent":"\n                                                                    <p></p><blockquote><p><small><em>“I liked that elf”</em></small></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600506170769408/simplypotterheads-i-liked-that-elf"},{"originalPostURL":"https://joshholloway.tumblr.com/post/168832175295","postBodyContent":"\n                                                                    <p></p><p><b><a href=\"http://joshholloway.tumblr.com/tagged/gtkm\">get to know me:</a> </b>\n\n[1/5] current celebrity crushes\n\n→ Chris Hemsworth&nbsp;&nbsp;<br></p><blockquote><p>As a kid, you run around the house pretending to be a superhero, and now to be doing it as a job, I feel very lucky.</p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717600503439196160/joshholloway-get-to-know-me-15-current"}]