[{"originalPostURL":"https://mightyhealthyquest.tumblr.com/post/97900911355","postBodyContent":"\n                                                                    <p>IT’S ALWAYS TEA TIME!</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326895370616832/mightyhealthyquest-its-always-tea-time"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326878506336256/what-the-signs-reveal"},{"originalPostURL":"https://isobelstevenz.tumblr.com/post/154350432798","postBodyContent":"\n                                                                    <p></p><blockquote><p><small><b><a href=\"http://isobelstevenz.tumblr.com/tagged/buffyverse%20meme\">buffyverse meme</a> </b>//<i> </i>(5/15) characters - cordelia chase<b></b></small></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326873533956096/isobelstevenz-buffyverse-meme-515"},{"originalPostURL":"https://sassykardashian.tumblr.com/post/83795710513","postBodyContent":"\n                                                                        <p>my heart says yes but my bank balance says no</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326848771817472/sassykardashian-my-heart-says-yes-but-my-bank"},{"originalPostURL":"https://beatricprior.tumblr.com/post/154945810035","postBodyContent":"\n                                                                    <p></p><blockquote><p><small>Just because you did not see me does not mean I was not with you.</small><br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326844989603840/beatricprior-just-because-you-did-not-see-me"},{"originalPostUsername":"","postBodyContent":"\n                                                                    <p><a href=\"https://tumblr.com/tagged/wow-but-why-isn%27t-everyone-all-over-this-scene-yet\">#wow but why isn’t everyone all over this scene yet</a><a href=\"https://tumblr.com/tagged/this-isn%27t-just-dawn-fucking-summers-performing-an-exorcism-like-a-badass\">#this isn’t just dawn fucking summers performing an exorcism like a badass</a><a href=\"https://tumblr.com/tagged/this-is-dawn-actually-improvising-an-exorcism\">#this is dawn actually improvising an exorcism</a><a href=\"https://tumblr.com/tagged/standing-up-when-she%27s-being-pushed-down\">#standing up when she’s being pushed down</a><a href=\"https://tumblr.com/tagged/using-her-inner-strenght-and-the-strenght-people%27s-love-has-given-her\">#using her inner strenght and the strenght people’s love has given her</a><a href=\"https://tumblr.com/tagged/this-girl%27s-power-is-in-her-faith-and-conviction\">#this girl’s power is in her faith and conviction</a>&nbsp;(<a href=\"http://annesteele.tumblr.com/\">x</a>)<br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326841625870336/bisexualies-wow-but-why-isnt-everyone-all"},{"originalPostURL":"https://icybluepenguin.tumblr.com/post/117267974687","postBodyContent":"\n                                                                        <p>I’ve seen a lot of posts recently reminding readers to leave feedback on fics, which is great!! &nbsp;Writers deserve all the love they can get. &nbsp;Likes, reblogs, comments, messages, these are the lifeblood of writers. &nbsp;They are proof that people are reading, that they’re enjoying, and that they want more. &nbsp;</p><p>But maybe readers don’t know what to say. &nbsp;Maybe you’re new to Tumblr, new to reading fan fiction, shy, or just not sure how to say what you want to say.</p><p>Let me start by saying, <i>no matter how popular the blog or how cool you think they are,</i> everyone loves a compliment. &nbsp;If you’re worried about sounding silly or bothering people, let me assure you- a message will make your writer do a happy dance (depending on the writer, they may<i> actually</i> get up and dance. &nbsp;I have.)</p><p>Here’s the basic ways of communicating with writers on Tumblr:</p><p><b>Likes and kudos-</b> these are great, they’re the high-fives in this world. &nbsp;They’re the “hey, nice” nod.<br><b>Reblogs-</b> even better, because they mean exposure. &nbsp;More people see the story and that makes us really happy. &nbsp;A reblog with a comment is<i> amazing</i>, especially one that entices others to read. &nbsp;These make a writer’s day.<br><b>Comments and messages-</b> these are the thing that keeps us going. &nbsp;Most of us have anon turned on- and if we don’t, just let us know you want a private reply. &nbsp;(And, if your writer has anon off, it probably means they’ve been getting hate and deserve extra love.)<br><b>Recommendations-</b> recs are like coming in to work to find someone baked your favorite cake and left it on your desk. &nbsp;Recommendations make your writer feel so loved and valued!</p><p>So, that’s all good, but what do you actually SAY to writers? &nbsp;It doesn’t have to be much or take a lot of time.<br></p><p>A simple “This is great/funny/hot!” is wonderful. &nbsp;\"Best fic I’ve read this week!“ &nbsp;\"Funny as hell and cute too.” &nbsp;\"You have to read this, it’s awesome!“ &nbsp;\"I can’t wait for more of this.” &nbsp;\"I hope you keep going!“ &nbsp;These are great in reblogs and in messages.<br></p><p>Even better is<b> specific feedback</b>. &nbsp;We<i> love</i> specific feedback, because it tells us what readers liked and what they didn’t. &nbsp;Want to influence our next fic? &nbsp;Tell us what you liked about this one and I bet you it will keep showing up! &nbsp;Specific feedback is just telling the writer what you liked. &nbsp;It doesn’t have to be long or complicated, either. &nbsp;(But if you write a lot, we will love you so much.)</p><p><b>Was there a character you liked?</b> &nbsp;Talk about them: &nbsp;\"I love how you wrote X” “Y was so funny!” &nbsp;\"OMG I wanted to STRANGLE Q!“ &nbsp;\"You can really feel X’s frustration.” &nbsp;\"Y has so much depth, they’re a really well-rounded character.“ &nbsp;\"R says so much with so few words, it’s amazing.”</p><p><b>What about a part or line you enjoyed?</b> &nbsp;\"That bit in the park- LOVE IT.“ &nbsp;\"I have never read a better description of a cup of tea.” &nbsp;\"The way you wrote about his fear, that was heartbreaking.“</p><p><b>Was there a part that made you feel something?</b> &nbsp;Happy, sad, angry? &nbsp;\"That last sentence killed me, he’s so broken.” &nbsp;\"I wanted to jump around when they finally kissed!“ &nbsp;\"This chapter was so tense, my heart was pounding by the end.”</p><p><b>Did the characters or plot or setting remind you of your life?</b> &nbsp;\"I live in Brussels, that’s just how that street looks.“ &nbsp;\"When Y talked about R, I knew exactly how he felt.” &nbsp;\"You captured that lost, aimless feeling perfectly; I’ve so been there.“</p><p><b>Are there unanswered questions?</b> &nbsp;Mention how much you want the answers. &nbsp;\"I can’t wait to find out what’s in the basket!” &nbsp;\"That was a cliffhanger ending, wow.“ &nbsp;\"How is she going to explain THAT?” &nbsp;(some writers are touchy about &nbsp;predicting, though, so stay away from “I bet he’ll throw that letter out.” or “X is clearly coming back.”)<br></p><p><b>A few closing notes:</b> be enthusiastic if that’s your style, go crazy with exclamation marks, smileys, caps! &nbsp;Tell a writer if you’re rereading their work- very little makes us happier than knowing our writing has the staying power for a second, third, sixth, tenth read. &nbsp;Did a reread give you a new insight or feeling about the fic? &nbsp;Tell us! &nbsp;We will be<i> so excited</i> to hear. &nbsp;And remember, recommendations are wonderful- putting up a random post tagging your favorite writers or fics you’re enjoying will show the writers that they’re writing is more than a flash in the opan and they’ll get some new readers too!</p><p>We can’t do this writing thing without you guys. &nbsp;So thank you so much! &nbsp;Without readers, we’re just talking to ourselves. &nbsp;We love and appreciate you for reading- but we need to know you’re doing it. &nbsp;We need feedback like we need <b>air</b>. &nbsp;Don’t let your favorite writers suffocate! :)</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326826253713408/how-to-praise-writers-and-influence-fics"},{"originalPostURL":"https://nevillxes.tumblr.com/post/154901504676","postBodyContent":"\n                                                                    <p><i>&nbsp;</i><b><a href=\"http://nevillxes.tumblr.com/tagged/moodboards\">Character Moodboards</a></b>&nbsp;⟶ <b>h</b>ermione granger&nbsp;</p><blockquote><p>↳ <i>gift&nbsp;for <a>@cleverbrighthermione</a>​</i></p></blockquote><p><i>“Books! And cleverness! There are more important things-friendship and bravery…”</i><br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326816403324928/nevillxes-character-moodboards-hermione"},{"originalPostUsername":"pcvensiies","postBodyContent":"\n                                                                    <p></p><blockquote><p><small><b><a href=\"http://pcvensiies.tumblr.com/tagged/narniaedit\">aesthetic</a></b>: polly plummer</small></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326813473701888/pcvensiies-aesthetic-polly-plummer"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719326808422727680/jeffersonmadisonburr-hamilton-we-know-you-stole"}]