[{"originalPostURL":"https://amyjake.tumblr.com/post/160815256057","postBodyContent":"\n                                                                    <p><small>If you guys won’t help me, I guess I’ll just get myself off… Context. Context was important on that one.</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335997734256640/amyjake-if-you-guys-wont-help-me-i-guess-ill"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335994590543872/scholarc-the-notes-are-broken"},{"originalPostURL":"https://thlestrals.tumblr.com/post/163829131321","postBodyContent":"\n                                                                    <p></p><p>@hpeditsnet creation event: Get to know our members week&nbsp;☞ Day 6: <b>Golden trio</b> <strike>or silver trio</strike></p><blockquote><p><i>Why is it, when something happens, it is always you three?</i></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335991519264768/thlestrals-hpeditsnet-creation-event-get-to"},{"originalPostURL":"https://studyblr.tumblr.com/post/162983831329","postBodyContent":"\n                                                                        <p>here’s to every girl working so so hard to reach her goal. i see you. you can do it.</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335986709528576/studyblr-heres-to-every-girl-working-so-so-hard"},{"originalPostURL":"https://lannisten.tumblr.com/post/163825018443","postBodyContent":"\n                                                                    <p><small>Are you a sheep? No. You’re a dragon. Be a dragon.</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335983908683776/lannisten-are-you-a-sheep-no-youre-a-dragon"},{"originalPostURL":"https://kazaikos.tumblr.com/post/163800269070","postBodyContent":"\n                                                                    <p>Colored version of <b>Vaderdala</b>, artwork by <a href=\"https://tmblr.co/mMgR60qp9CPh6BvYY4y1CxQ\">@good-call-my-young-padawan</a> from her beautiful <a href=\"https://good-call-my-young-padawan.tumblr.com/post/157060215906/anivader-and-his-rebel-wife-au-padm%C3%A9-is-alive-and\">Ani/Vader and Padme/Rebel Wife AU</a>.&nbsp;</p><p>Last post, because I promised I would post this for you. &lt;3</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335980790300672/itwasyouu-kazaikos-colored-version-of"},{"originalPostUsername":"demeantors","postBodyContent":"\n                                                                    <p></p><p><b><a href=\"https://tmblr.co/medvOuRcJZBOpG-5en2McvQ\">@hpquidditchnet</a> <a href=\"http://hpquidditchnet.tumblr.com/post/163021895781/hi-guys-our-first-network-event-is-a-way-to-get\">creation event</a></b>: get to know the members</p><p>↳ favorite quidditch character: <b>Weasley twins</b></p><blockquote><p><i><small>“</small>\n\nWe’ve got two unbeatable Beaters.”<br><small>“</small>\n\nStop it Oliver, you’re embarrassing us,” said Fred and George Weasley together, pretending to blush.</i></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335976584380416/demeantors-hpquidditchnet-creation-event-get"},{"originalPostURL":"https://sophrigerator.tumblr.com/post/163661887106","postBodyContent":"\n                                                                    <p>people thought dragons were gone forever, yet here they are<br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335973382029312/sophrigerator-people-thought-dragons-were-gone"},{"originalPostURL":"https://pumpkinspicereyna.tumblr.com/post/99937563305","postBodyContent":"\n                                                                    <p></p><pre>Nico was devastatingly alone. He’d lost his big sister Bianca. He’d pushed away all other demigods who’d tried to get close to him. His experiences at Camp Half-Blood, in the Labyrinth and in Tartarus had left him scarred, afraid to trust anyone.<br><br>[<a href=\"http://minuiko.tumblr.com\">art credit</a>]   [<a href=\"http://pumpkinspicereyna.tumblr.com\">edit</a>]</pre>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335969726758912/pumpkinspicereyna-nico-was-devastatingly-alone"},{"originalPostURL":"https://vampwillow.tumblr.com/post/159995159949","postBodyContent":"\n                                                                        <p><b>aries:</b></p><p><i>type 1</i> -&nbsp;“i’m an aries!”, loud, starts driving before everyone has their seatbelt on (or before people even get in the car), loves cooking but usually just buys everything from the store and pretends they put hard work into it, hard to tell if they’re stupid or smart.</p><p><i>type 2</i> - takes 100 selfies in a row, does really cool makeup, doesn’t believe in school,&nbsp;“this musical artist is SO under appreciated.”</p><p><b>taurus:</b></p><p><i>type 1</i> - down to earth, has neat handwriting and doodles in class, patient, bird-lover, likes making flower crowns, laughs a lot.</p><p><i>type 2</i> - show-off, amazing memory, can be an edgy people-hater, loves yelling, gives people weird nicknames.</p><p><b>gemini:</b></p><p><i>type 1</i> - two-faced, feels like they need something in return for their actions, cares more about bagels than people, the friend who everyone worries about.</p><p><i>type 2</i> - loves reading, kind and supportive but awkward about it, the type of person you call when you need advice, snappy when they’re being interrupted, watches 5 tv shows at a time.<br></p><p><b>cancer:</b></p><p><i>type 1 </i>-<i> </i>down for literally any adventure, cries or has a breakdown while eating, doesn’t realize some things they do are harmful to themselves but can sense when others have a problem.</p><p><i>type 2</i> -&nbsp;talks very fast, takes on any task without a problem, loves talking about themselves, can probably do 10 backflips in a row, moody,&nbsp;sends smiley emojis in every text message.</p><p><b>leo:</b></p><p><i>type 1</i> - attention-seeking, wants everyone to respect them, says “lol” out loud, laughs at their own stories but sometimes forgets to listen to others, animal lover, a good role model.<br></p><p><i>type 2</i> - genuinely cares about their friends and checks up on them always, super chill and easygoing, fashionable, gives great hugs, someone you go to when you’re sad.</p><p><b>virgo:</b></p><p><i>type 1</i> - shy, gentle, awful at explaining things and you really never know what they’re talking about, offers everyone gum, knows all the lyrics to every song they listen to.</p><p><i>type 2</i> - anxious about tiny things but ignores huge problems, cares so much about others that it gets annoying, likes to redecorate or organize their room for fun, loans you a pencil and forgets to ask for it back.</p><p><b>libra:</b></p><p><i>type 1</i> - movie expert, likes when people laugh at their jokes, untrustworthy but somehow you trust them anyway, casually shares deep secrets or personal information randomly like it’s no big deal.<br></p><p><i>type 2</i> - doesn’t like opening up or sharing feelings, artistic and individualistic, doesn’t have problems with anyone or anything.</p><p><b>scorpio:</b></p><p><i>type 1</i> - calm/quiet and very open minded, loves the ocean, nice but when provoked they turn into a whole other person (who is terrifying),&nbsp;very passionate about their interests.</p><p><i>type 2</i> - doesn’t ever know what’s happening, suspicious and questions others’ motives, either loves someone or hates them, never shares secrets. ever.</p><p><b>sagittarius:</b></p><p><i>type 1</i> - plays at least 3 musical instruments, likes being right, theater kid, extrovert one minute and introvert the next, opens up to others and immediately regrets it.<br></p><p><i>type 2</i> - angsty teen attitude, has strong opinions, blames problems on others, maybe has a heart deep down?</p><p><b>capricorn:</b></p><p><i>type 1</i> - makes fun of everything, the most extroverted friend, pretends like they don’t care about others’ opinions but deep down is extremely self-conscious, forgetful, funniest jokes.</p><p><i>type 2</i> - honestly? a real fucking pain in the ass.</p><p><b>aquarius:</b></p><p><i>type 1</i> - feminist, nature lover and very free spirited, knowledgeable and factual, has a silly side, cool hair, can listen to all your problems but will never know what to say.</p><p><i>type 2</i> - can be cold but they are just trying to protect themselves, has one character/idol that they would literally die for, has probably made up all of the funny stories they tell because they want others to like them.</p><p><b>pisces:</b></p><p><i>type 1</i> - extremely honest but can doubt their beliefs since they try to get along with everyone, generous when it comes to material but will not give up themselves to others.</p><p><i>type 2</i> - understanding, shy extrovert, great with advice but doesn’t know how to take other people’s advice (asks for help but doesn’t want to), never fully present or in the moment.</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718335966152196096/two-types-of-the-signs-mostly-based-on-people-i"}]