[{"originalPostURL":"https://herhighnessthequeen.tumblr.com/post/163618112440","postBodyContent":"\n                                                                        <p></p><p>I’m currently in PA school with close to a 4.0 GPA, and with college and back to school starting up, I’m dropping some tips for y'all.  A hoe gotta get bomb ass grades if ya want a bomb ass career and to be successful af.   So let’s get it✨</p><p>1.  Write out your notes.   Have two notebooks: one for when you’re in class (this one can be messy) and one for at home (this one is the neater one, for color coding, formatting, and all that organizational jazz).   Writing things out is proven to enhance memorization 7X more than just reading is.</p><p>2.  Have a go-to format for your notes.   Numbering, bullet points, whatever floats your boat.</p><p>3.  Type out your notes.   I use Google Drive, because it automatically saves all your shit, and you can access your notes via your Google account literally anywhere.    Typing out your notes does the same thing writing them out does, as far as helping you review the material.</p><p>4.  Use Quizlet.   Quizlet is a free flashcard website/app that allows you to type in all of your flashcards and definitions, and gives you review options like matching, testing, flashcard mode, and more.   This shit made me my high schools valedictorian, no lie.</p><p>5.   Keep your old quizzes and tests.  Often times, teachers will ask similar questions on finals.</p><p>6.   For math-based subjects, always always always show your work in your notes.   I try to explain each step for a math problem in the margins of my notes, and generalize how to do each problem at the end.</p><p>7.   Do practice problems consistently.</p><p>8.  For my college hoes: never take an 8 am class.  You think you can do it because you did it for high school, but I promise you will regret it.   If there’s no avoiding the 8 am lecture, bring coffee and skip any makeup/hair that day.  Sleep is too important.</p><p>9.   Make flashcards.   The night before my exams, I like to try and fit everything I need to know for a specific chapter/topic onto one flashcard, in order to weed out main ideas.</p><p>10.   For essays, easybib.com is amazing with free citations to avoid any plaigiarism or incorrect bibliographies.</p><p>11.  Rent👏your👏textbooks👏.   Unless your teacher specifically requires you BUY it, you likely won’t need the actual textbook.   Buying access codes for the book online is hundreds of dollars cheaper.</p><p>12.   If you do get your textbooks, a lot of them have chapter summaries at the end of each chapter.  Be sure to write out/type out/review those summaries.</p><p>13.  For science labs, if you are allowed, take pictures of any models or slides you need to know for your exams.   Pretty much all labs won’t let you take pictures of cadavers or animal dissections, but plastic models and microscope slides should be fine.</p><p>14.   If you have a question, ASK YOUR TEACHER.  It is better to look stupid in class and get your clarification, than to look stupid when you get your exam back and actually have it count against your grade.</p><p>15.  Do study groups.   I have two nursing friends in some of the same classes as me, and we’d always meet up before exams to go over the material.   We would bring dry erase markers and map out shit in empty classrooms, taking turns explaining shit to each other until we nailed it.</p><p>16.  Try to teach the material.   Like I said in #15, study groups are great for this.   By teaching the material out loud, you are subconsciously reviewing it yourself.  This is a HUGE help.</p><p>17.   Take breaks.  You cannot exhaust yourself and expect to still recall anything you learned.</p><p>18.  I know everyone does this and there’s no avoiding it sometimes, but DO NOT CRAM.  Gradual learning is most effective.</p><p>19.  Have one day every week where you don’t do any schoolwork.  You need time to reboot.</p><p>20.    Use your phone’s calendar/task checklist app for all major assignments, due dates, exam dates, study plans, appointments, etc.   Set reminders as needed.</p><p>21.   Charge your phone in another room while studying.  No distractions.</p><p>22.   Rainymood.com is a free website that plays a 30 minute loop of rain sounds.  It helps me focus like nothing else, especially in my loud ass household, and every time the loop stops and replays, I know to take a break between 30 minute study sessions.</p><p>23.   Feel distracted at home when studying?  Try studying in a library, cafe, or even at school.   I find that going somewhere else to study actually forces me to pay attention to what I’m doing, for some reason.</p><p>24.   Reward yourself for good grades.  Buy yourself a slice of pizza or a new highlight, have a netflix marathon, go to a party, or take a nap.  Whatever conveys a job well done, do it.  It’ll make all that studying feel that much greater when it’s over, and you’ll have a goal to work towards. </p><p>25.  Sit in the front of the classroom as often as possible.  You’ll be forced to pay attention, be able to actually see the board, hear the instructor better, and you’re more likely to have your questions answered quickly because your teacher will actually see your hand go up.</p><p>26.    Caffeinate.   I prefer tea because it’s healthier, but coffee works too.   Ya girl is NOT a morning person, but my morning tea at least helps me pay attention during earlier classes.</p><p>27.   Keep all of your school shit organized, together, and labelled. </p><p>28.   Do NOT skip a class just because you’re lazy or don’t feel like going. The temptation is real sometimes, but a hoes gonna be pissed when ya see your participation average decline.</p><p>29.   This may just be a psychological thing, but I love to use the same colored/brand of pen for all of my notes/assignments/tests.   It just makes everything seem more uniform, and I’m able to recall information better.</p><p>30.   Trouble taking tests? For any multiple choice question, read the question and try to answer it first without reading any of the options.   If your answer doesn’t match the options, then use process of elimination to find the best answer.    For true/false questions, write out justifications for each answer (you can also do this for multiple choice).  You’ll be acing your exams in no time. </p><p>31.   Chewing gum during class/studying, and chewing that same flavor gum during the exam, has been scientifically proven to boost your memory recall.</p><p>32.   Literally any time you have the opportunity to do extra credit, DO IT.  Cherish that shit. </p><p>33.   If you aren’t doing so hot in a particular class (literally any math class for me lol), schedule a private meeting with your professor and go over test questions you missed, or topics you didn’t get.    If you know your professor is a flop, or can’t get an appointment, meet with a tutor or another professor of that same subject.  Sometimes another voice can shed new light on a difficult topic.</p><p>34.  For essays, readable.io critiques your writing for free based on readability, grade level, formality, tone, grammatical errors, etc.   Seriously a life saver.</p><p>35.  Also thesaurus.com is ya bff for fancier words/phrases to make your writing more eloquent</p><p>36.  Always make an outline for every essay or project to organize what you want to say.   This will keep you on track, and help you work around any quotes or sources in you writing to make sure your writing is hella organized.</p>\n\n\nThat’s all I can think of for now, please please please feel free to add and share.   Enjoy those 4.0’s, hoes💞\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332646510542848/hoe-tips-school-and-studying"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332643742269440/could-you-please-draw-nico-in-a-man-bun-3"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332641070481408"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332638393450496"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332635721728000"},{"originalPostUsername":"official-ryden","postBodyContent":"\n                                                                        <p>i don’t know ewan mcgregor personally, but i trust him</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332595408109568/official-ryden-i-dont-know-ewan-mcgregor"},{"originalPostURL":"https://theclexahermit.tumblr.com/post/109693246610","postBodyContent":"\n                                                                        <p>“Forever is a long time, but I wouldn’t mind spending it by your side.”</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332592369319936/theclexahermit-forever-is-a-long-time-but-i"},{"originalPostURL":"https://katie-bell.tumblr.com/post/163958418065","postBodyContent":"\n                                                                    <p></p><h2><b>\n\n“<i>Why shouldn’t I? Mudblood, and proud of it!</i>”</b></h2><p>url edit for <a href=\"https://tmblr.co/mIsqZFb2PR3QdxR-WAFFZNA\"></a><a href=\"https://tmblr.co/mIsqZFb2PR3QdxR-WAFFZNA\">@hermionevgranger</a></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332588474908673/katie-bell-why-shouldnt-i-mudblood-and"},{"originalPostURL":"https://cosmicgf.tumblr.com/post/160523296146","postBodyContent":"\n                                                                        <p>no offense but i want every little kid to be safe and have a good childhood</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332585414180864/cosmicgf-no-offense-but-i-want-every-little-kid"},{"originalPostURL":"https://elisabetholsen.tumblr.com/post/164111203955","postBodyContent":"\n                                                                    <p> <small>\nTony Stark <a href=\"http://tonystarkz.tumblr.com/tagged/**\">+ </a>anxiety&nbsp;</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718332581613092864/elisabetholsen-tony-stark-anxiety"}]