[{"originalPostUsername":"badspacedads","postBodyContent":"\n                                                                    <p></p><blockquote><div><sub>best of Loki in <i>The Avengers</i> (2012)</sub></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157795760930816/badspacedads-best-of-loki-in-the-avengers-2012"},{"originalPostUsername":"lilabeanz","postBodyContent":"\n                                                                    <p>sometimes she’ll tuck her wand behind her ear, and then lose it in the frizz</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157793043103745/lilabeanz-sometimes-shell-tuck-her-wand-behind"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157790328307712"},{"originalPostURL":"https://zoewashburne.tumblr.com/post/41243655683","postBodyContent":"\n                                                                    <p></p><blockquote><div><div><div><div><div><div><div><div><p><small>“What’s all this?” </small><br><small>“Lunch. I was hungry.” </small><br><small>“You don’t eat food.” </small><br><small>“Oh, I can. It doesn’t keep me alive, but, you know, sometimes I get a hankering.” </small></p></div></div></div></div></div></div></div></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157787637661696/zoewashburne-whats-all-this-lunch"},{"originalPostURL":"https://sortinghatchats.tumblr.com/post/121904186113","postBodyContent":"\n                                                                        <p>The basic structure of the <a href=\"http://tmblr.co/mOkjNsF86sjLQQttRyohhgg\">sortinghatchats</a> system is that you aren’t just sorted into one House, but into two tiers of Houses: Primary and Secondary. Your Primary House defines <b>WHY</b> you do things. Your Secondary defines <b>HOW</b>. To build this system, we’ve drawn on the Sorting Hat’s songs, general HP canon, extracanonical data (ex. interviews with JKR)… and then extrapolated. </p><p>People are complex– for joy or for utility, due to social pressure or careless recreation, people often use the reasoning or methods of Houses that aren’t their Primary or Secondary. We call this “modelling” or “performing” a house and we will explain it in greater detail later. These additional layers help us capture some complexities in characters that we couldn’t get using Primary and Secondary alone. People can vary hugely in how they embody their Houses; in this system, Aang, the heroic pacifist protagonist from <i>Avatar the Last Airbende</i>r, shares most of his Houses with <i>HP</i>’s Lord Voldemort. </p><p>The way you decide which Houses are yours is not necessarily by looking at what you do, but at what would make you proudest and most content if you were strong enough to do it. Your sorting is what you <i>want</i> to be and what you believe you <i>should</i> do, whether or not you actually live up to it. That’s how people like Peter Pettigrew can end up in Gryffindor. </p><p><b>PRIMARIES</b></p><p>Your Primary is your why. It’s your motivations, your values, and the way you frame the world around you. It’s how and what you prioritize, and what you weigh most heavily when making your decisions. People often also assume that others share those priorities. A common response to our system is “but you must oversort into Gryffindor/Slytherin/Ravenclaw/Hufflepuff–<i>everyone</i> has that type of morality, deep down!”</p><p><i>Gryffindor Primaries </i>trust their moral intuitions and have a need and a drive to live by them. They feel what’s right in their gut, and that matters and guides them. If they don’t listen to and act on that, it feels immoral. </p><p>We call Gryffindor morality “felt” but that doesn’t mean they’re all impetuous, emotional hellions. Gryffindors can still be intelligent, deliberate creatures who weigh their decisions and moralities carefully. Reasoning, intellectualizing and debate can be support for a Gryffindor’s felt morality– but those things can never make a fully satisfying morality in themselves. Some things are just wrong, no matter what pretty words you use to explain them. </p><p><i><a href=\"http://sortinghatchats.tumblr.com/post/122345303723/on-ravenclaw-primaries\">Ravenclaw Primaries</a></i> have a constructed system that they test their decisions against before they feel comfortable calling something right. This system might be constructed by them, or it might have been taught to them as children, or it might have been discovered by them some point later in life. But it gives them a way to frame the world and a confidence in their ability to interact with it morally. <br></p><p>Ravenclaws do not lack an intuitive sense of morality or gut feeling about things, but they distrust those instincts and have a need to ignore or to dig down deep and dissect those internal moral impulses. Living within their built moral system is as important to a Ravenclaw as to a Gryffindor; it’s the source of the morality that differs between them–what they trust. </p><p><i>Hufflepuff Primaries</i> value people–all people. They value community, they bond to groups (rather than solely individuals), and they make their decisions off of who is in the most need and who is the most vulnerable and who they can help. They value fairness because every person is a person and feel best when they give everyone that fair chance. Even directly wronged, a Hufflepuff will often give someone a second (or fifth) chance. </p><p>This doesn’t mean all Hufflepuffs are inherently tolerant human beings, any more than all Gryffindors are inherently good, moral creatures. Hufflepuffs tend to believe that all people deserve some type of kindness, decency, or consideration from them–but they can define “person” however they want, excluding individuals or even whole groups. </p><p><i>Slytherin Primaries</i> are fiercely loyal to the people they care for most. Slytherin is the place where “you’ll make your real friends”– they prioritize individual loyalties and find their moral core in protecting and caring for the people they are closest to. </p><p>Slytherin’s reputation for ambition comes from the visibility of this promotion of the self and their important people– ambition is something you can find in all four Houses; Slytherin’s is just the one that looks most obviously selfish. </p><p>Because their morality system of “me and mine first” is fairly narrow in scope, Slytherins often construct a secondary morality system to deal with situations that are not addressed by their loyalty system.</p><p><b>SECONDARIES</b></p><p>Your Secondary is your how. It’s how you approach the world as a person interacting with it, and how you make your way. It’s how you problem-solve. It’s not necessarily what you’re best at, or even what’s the most useful to you, but about what skills and methods you value as being intrinsic to you. Do you improvise, do you plan? Do you work on something a little bit every day? Do you charge into the fray and tell people exactly what’s on your mind? What do you do? How would you describe the way you meet the world?</p><p><b>Note</b>: the term “Secondary” is not meant to imply that how you do things is any less important than why (the Primary House). It’s simply the way our terminology fell out and we’re too lazy to change it. The importance of motivations v. methods is a personal sliding scale– it’s perfectly valid for a person to identify with their Secondary House over their Primary. (When drawing from canonical sources, we assumed each character likely was in a House that matched to either their Primary or their Secondary. For instance, Harry is in Gryffindor for his heroic Gryffindor Primary, but Ginny Weasley is there for her brash and bold Gryffindor Secondary.)</p><p><i>Gryffindor Secondaries</i> charge. They meet the world head-on and challenge it to do its worst. Gryffindor Secondaries are honest, brash, and bold in pursuit of things they care about. Known for their bravery, it is almost a moral matter to stay true to themselves in any situation that they’re in.</p><p><i>Ravenclaw Secondaries </i>plan. They collect information, they strategize. They have tools. They run hypotheticals and try to plan ahead for things that might come up. They build things (of varying degrees of practicality and actual usefulness) that they can use later– whether that’s an emergency supply pack, a vast knowledge of Renaissance artistic techniques and supplies, or a series of lists and contingency plans. They feel less at home in improvisation and more comfortable planning ahead and taking the time to be prepared.</p><p><i>Hufflepuff Secondaries</i> toil. Their strength comes from their consistency and the integrity of their method. They’re our hard workers. They build habits and systems for themselves and accomplish things by keeping at them. They have a steadiness that can make them the lynchpin (though not usually the leader) of a community. While stereotyped as liking people and being kind (and this version is perhaps a common reality), a Hufflepuff secondary can also easily be a caustic, introverted misanthrope who runs on hard work alone. </p><p><i>Slytherin Secondaries</i> improvise. They are the most adaptive secondary, finding their strength in responding quickly to whatever a situation throws at them. They improvise differently than the Gryffindor Secondary, far more likely to try coming at situations from different angles than to try strong-arming them. They might describe themselves as having different “faces” for different people and different situations, dropping them and being just themselves only when they’re relaxing or feel safe. </p><p><b>But the Journey Continues…</b></p><p>These four basic Primary and Secondary houses are summarized starting places that we use as a basis for further discussion. What are some ways this gets complicated?</p> <p><a href=\"http://sortinghatchats.tumblr.com/post/121904186113/the-basics\" class=\"tmblr-truncated-link read_more\">Keep reading</a></p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157784901877760/the-basics"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157782183002112"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157779501711360"},{"originalPostURL":"https://jaclcfrost.tumblr.com/post/145468788463","postBodyContent":"\n                                                                        <p>staying @ someone else’s place is so perpetually uncomfortable? everything feels like an inconvenience + invasion of privacy. sitting in a chair? inconvenience. opening a cabinet to get a glass? invasion of privacy. breathing? invasion of</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157776803758080/jaclcfrost-staying-someone-elses-place-is-so"},{"originalPostURL":"https://dailymarvelqueens.tumblr.com/post/166673304428","postBodyContent":"\n                                                                    <p><b>Tessa Thompson</b> by Andre Wagner for New York Magazine’s The Cut.</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157774113161216/dailymarvelqueens-tessa-thompson-by-andre-wagner"},{"originalPostURL":"https://sergei-polunin.tumblr.com/post/167679296454","postBodyContent":"\n                                                                    <p></p><blockquote><p><small>“Fire burn and cauldron bubble! Something wicked this way comes!”<br></small></p></blockquote><p><small>Harry Potter and the Prisoner of Azkaban (2004) d.&nbsp;Alfonso Cuarón</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/718157771434016768/sergei-polunin-fire-burn-and-cauldron-bubble"}]