[{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513693613080576"},{"originalPostURL":"https://some-people-call-it-tragic.tumblr.com/post/170733693866","postBodyContent":"\n                                                                    <p><small>Jealous!Dean</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513690881605632/some-people-call-it-tragic-jealousdean"},{"originalPostUsername":"flynncarter","postBodyContent":"\n                                                                    <p></p><p><i><a href=\"https://flynncarter.tumblr.com/post/650313561637322753/color-palette-meme\">color palette meme</a></i><a><br></a><a href=\"https://tmblr.co/mej7dLvnuPplPphTmOpFTOA\"></a><a href=\"https://tmblr.co/mDxXi2boKGaEkhyAtAXui9g\">@gillespiecharlie</a>​ requested <b>PACMAN TRANSITION + LUKE PATTERSON&nbsp;</b><br></p><figure class=\"tmblr-full\"><a class=\"post_media_photo_anchor\" data-big-photo=\"https://64.media.tumblr.com/4f53a491ad093f05c97066f47e912fab/72a1e66889816c43-cd/s1280x1920/7baeadf8bdb7f2d913d503b94d4515ebc6e9e758.png\" data-big-photo-height=\"42\" data-big-photo-width=\"944\"><img class=\"post_media_photo image\" src=\"https://64.media.tumblr.com/4f53a491ad093f05c97066f47e912fab/72a1e66889816c43-cd/s1280x1920/7baeadf8bdb7f2d913d503b94d4515ebc6e9e758.png\" alt=\"image\"></a></figure>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513688174084097/flynncarter-color-palette-meme-gillespiecharlie"},{"originalPostURL":"https://hellerjackles.tumblr.com/post/658101530166181888","postBodyContent":"\n                                                                    <p>hope that helps&nbsp;✌️✌️✌️✌️✌️✌️✌️</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513685358673920/hellerjackles-hope-that-helps"},{"originalPostURL":"https://mishha.tumblr.com/post/634700214468575233","postBodyContent":"\n                                                                    <p></p><blockquote><p><small>\n\nfive things you know and <i>the one thing you don’t</i>. <a href=\"https://merlinsprat.tumblr.com/post/122950428971\">[insp]</a></small><br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513682571575296/mishha-five-things-you-know-and-the-one-thing"},{"originalPostURL":"https://benjiwyatt.tumblr.com/post/656093883329052672","postBodyContent":"\n                                                                    <p></p><p><b><small><a href=\"https://benjiwyatt.tumblr.com/tagged/psych15anniversary\">PSYCH 15ᵀᴴ ANNIVERSARY CELEBRATION</a></small></b><small>: Day 7 → Free Choice</small></p><blockquote><div><small>Shawn + holding pillows</small></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513679841083392/benjiwyatt-psych-15%E1%B5%80%E1%B4%B4-anniversary-celebration"},{"originalPostURL":"https://queenrojpag.tumblr.com/post/659429901114408960","postBodyContent":"\n                                                                    <p><b>Ladies Meme:</b> [4/7] deserved better<br>↳ Hannah Grose</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513677109493760/queenrojpag-ladies-meme-47-deserved-better"},{"originalPostURL":"https://meliorn.tumblr.com/post/659244564478115841","postBodyContent":"\n                                                                    <p><b><span style=\"color: #004cff\">H</span><span style=\"color: #0051ff\">O</span><span style=\"color: #0057ff\">W</span><span style=\"color: #005cff\"> </span><span style=\"color: #0062ff\">T</span><span style=\"color: #0067ff\">O</span><span style=\"color: #006dff\"> </span><span style=\"color: #0072ff\">G</span><span style=\"color: #0078ff\">E</span><span style=\"color: #007dff\">T</span><span style=\"color: #0083ff\"> </span><span style=\"color: #0088ff\">A</span><span style=\"color: #008eff\">W</span><span style=\"color: #0093ff\">A</span><span style=\"color: #0099ff\">Y</span><span style=\"color: #009eff\"> </span><span style=\"color: #00a4ff\">W</span><span style=\"color: #00a9ff\">I</span><span style=\"color: #00afff\">T</span><span style=\"color: #00b4ff\">H</span><span style=\"color: #00baff\"> </span><span style=\"color: #00bfff\">M</span><span style=\"color: #00c5ff\">U</span><span style=\"color: #00caff\">R</span><span style=\"color: #00d0ff\">D</span><span style=\"color: #00d5ff\">E</span><span style=\"color: #00dbff\">R</span></b> – <small>SEASON ONE (2014)</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513674387406848/meliorn-how-to-get-away-with-murder-season-one"},{"originalPostURL":"https://asheslikestardust.tumblr.com/post/659854380310413312","postBodyContent":"\n                                                                        <p><b>Dawn </b></p><p>Lucy smiles and its like the sun breaking over the horizon. You'd find her dipping her toes into the frigid sea that lies in the shadow of Cair Paravel before her siblings even stir in their beds; greeting the merfolk and breathing in the salty sea air. </p><p>She'd collect  pearly seashells as she walks along the stretch of the sandy beach and watches the sky turn from silvery pink to golden blue. Sometimes, Mr. Tumnus would join her and they'd frolic with the merfolk, running and chasing and swimming, both laughing madly. </p><p>More often than not, however, Lucy would run down to the beach alone, and listen to the world sleep. </p><p>Her bedroom has a bay window that houses an impressive collection of seashells, each gleaming in the stream of sunlight like sparkling gemstones. </p><p>She'd dance and twirl in the waves at low tide and watches the sea from afar at high tide and laughs as the salty spray of water drenches her hair and her nightgown. </p><p>Sea water clings to her eyelashes like tears, her hair falls in a golden sheet down her back and necklaces of coral and seaweed loop around her throat; colours of the sea resplendent against the pure white of her nightgown - gifts of affection and respect from the merfolk to the Queen who always reciprocated in kind. </p><p>By the time the sun rises in the sky and her people awake, Queen Lucy the Valiant would be slipping back into her chambers, with sparkling eyes and a giddy smile, ready to take on the new day. </p><p><br></p><p><b>Midday</b></p><p>Peter was, above all else, a great listener. It was hard not to be, what with being the eldest of four chatterbox siblings.  </p><p>People would assume Edmund to be the quiet  brother of the two of them and they'd be very much mistaken. </p><p>Peter was not very comfortable on his throne (and who <i>would</i>  be- its all twisted metal and sharply cut gemstones and heats <i>horribly</i> in the summers-) but looking at him you'd never know it. </p><p>He doesn't lounge, but doesn't sit stiffly either; his shoulders are relaxed and his hands rest easily on the carved armrests. </p><p>His gaze is always warm and inviting and his smile is kind and those who come to him for counsel often forget he wears a crown at all. </p><p>Fauns and drayads and centaurs from all corners of Narnia come to pay homage to the High King. They arrive in awe and slight fear of meeting <i>King Peter the Magnificent</i>, High King over all Kings in Narnia, Knight of the Most Noble Order of the Lion; but leave cheerful and contented, with the feeling of being wrapped in a warm hug, having met <i>Peter</i>, the friend, the brother, the mother-hen.</p><p>There is a skylight in the war rooms of Cair Paravel that lets the overhead sun bathe maps and other assorted weapons scattered on tables in the circular room in a strong, golden light. In these rooms, Peter's whole stance changes.</p><p>The friendly countenance and smiling eyes are no where to be seen and the hardened warrior who fought the White Witch blade-to-wand takes his place. </p><p>Peter wields his sword like an extension of his own arm. The red lion on his shield glistens like fresh blood in heat of the afternoon sun and Peter's metal chainmail clinks as he goes round and round and round the training field, fending off opponents from all sides. </p><p>Fearsome opponents they are too, for Lucy is swift and sure and Susan is as lethal as she is graceful and when Edmund and Philip team up, it is best to stay far, far away; but Peter did not become Emperor of the Lone Islands with luck alone and he is at his strongest with his sword, Rhindon, in his hand and defeats them all easily. </p><p>Their laughter echoes against the warm castle walls, joyful and bright, and Peter's is the loudest of all as he wrestles with his brother and playfully glares at his sisters, courtly manners and graces all but forgotten in the balmy summer air.</p><p><br></p><p><b>Twilight</b></p><p>Edmund was a diplomat. He was as trained in the art of wordcraft as he was in the art of warfare. </p><p>Peter insisted that all the griping and complaining Edmund did when they were younger was now helping him deal with whiny nobles from Archenland and Galma who did nothing but gripe and complain. Edmund's response was to flip him the bird. </p><p>He was cultured, refined and smooth in the company of ambassadors; deflecting certain questions, answering others with brutal honesty. Susan was <i>so</i> proud of him. </p><p>He was honest, honourable and humble in the company of knights. He told amusing tales and sang amusing songs in the light of the campfire, he looked out for his knights and heard their worries. </p><p>He shared their joys and their sorrows, he played as many pranks on his fellows-in-arms as they played on him,<i> </i>he fought for them and bled for them and they knew he would die for them as they would for him.</p><p>He was beloved, not only by his knights, but also by the people of Lantern Waste, and Peter couldn't be <i>prouder</i>.</p><p>He slipped into masks as easily as breathing, from <i>King to Knight to Judge to Friend to Symbol to Myth to Lover to Guardian to Warrior</i>, but his favourite is <i>Brother, </i>when he lets go off all his duties at the end of the day and simply - falls into a chair with all the grace of an uncooked pancake. </p><p>When he can sit in one of the many balconies of Cair Paravel, curl up with his siblings, and watch the sun set in a blaze of colour.</p><p> When he can watch the sky paint the sea and the castle in shades of blue. </p><p>When everything is still and peaceful and it feels like everyone is holding their breath - just before the first fireflies emerge from the trees, glowing softly, illuminating Lucy's sleepy face. </p><p>When he can just be Ed -<i> </i>not King Edmund the Just, Duke of Lantern Waste, Count of the Western March and who knows what else; <i>Ed, </i>brother and friend and current victim of Peter's latest prank, <i>Ed</i>, beloved by his family - and that is more than enough for him. </p><p>And when he resists punching Peter in the face for painting his black curls a startling green? Well. That's when Lucy's proudest of all. </p><p><br></p><p><b>Midnight</b> </p><p>Susan was an open book. She was beautiful and charming and graceful and clever and everyone agreed she was a perfect lady with perfect manners and perfect posture, just <i>perfect, perfect, perfect.</i></p><p>Heads would start as she walked past, hair braided with flowers and silken dress whispering against the carpeted halls and people would come up to her to sing her praises and she would never refute them, just smile gently and thank them sincerely, from the bottom of her heart. </p><p>People from other lands would look at her, Queen Susan the Gentle, in all her beauty and finery, so elegant, so <i>pure</i> next to her calloused and scarred brothers and sister and think her the weakest link of the four, and she would smile, all sharp teeth, and let them continue to think so. </p><p>She let them see the porcelin doll of a surface and think that's all there is to her, let them never look beyond into the wild storm of deadly claws and broken glass that lay behind her eyes, the always sharp quiver of arrows that lay in her room, the curved bow that rested strung and polished by her bedside, the jagged edge ivory hairpins that held up her hair even now.</p><p>Let them never guess that even a single petal from one of the flowers wound in her braid could incapacitate a fully grown man if ingested; that the shoes she wore under her dress weren't delicate heels but steel toed boots, that her dress was more of an armory than evening wear, that her brothers and sisters may triumph over their foes under the light of day but she did the same in the cover of night. </p><p>She was as lethal as she was beautiful, as vicious as she was charming; level headed, with a good mind for strategy, the only one who could beat her at chess was Edmund and oh so <i>very</i> protective of her family and her people. </p><p>Lucy once compared her to a mother bear. Susan, sweet, gentle Susan, who knew exactly how to use her looks and her words, who used the title Alsan has bestowed upon her to stay out of sight and out of mind, who had set up the most comprehensive secret police service Narnia had ever known (take notes, White Witch), grinned wickedly and answered that mother bears should be compared to <i>her.</i></p><p><i> </i>Susan was brilliant and radiant and careful and cunning. She was also the most loving and nurturing person her people ever had the pleasure of knowing.</p><p> She was as mysterious as the night, and the Narnians, unlike dignitaries from overseas, knew she wasn't an open book at all. Nor was she a puzzle waiting to be solved. </p><p>She was simply Queen Susan, their Protector. Queen Susan, who reigned destruction down on those who threatened the land she loved so much. </p><p>They did not adore her as they did Queen Lucy, did not swear loyalty to her as they did King Edmund, did not feel overwhelming awe and affection for her as they did King Peter, but they respected her and cherished the pages of life she shared with them forevermore. </p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513671617085440"},{"originalPostURL":"https://hunterschafer.tumblr.com/post/651980417205927937","postBodyContent":"\n                                                                    <p><small><b>ANYA TAYLOR JOY</b></small><br><small>SNL Season Finale</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716513668895064064/hunterschafer-anya-taylor-joy-snl-season-finale"}]