[{"originalPostURL":"https://subtle.tumblr.com/post/173085852637","postBodyContent":"\n                                                                        <p><b>Aries</b>: will try to win not for pride or reward, but for just the literal sake of winning. absolute childlike goofball mess when getting attached to someone new. terrible liars. may not apologize to you, but will still feel terrible for being wrong. actually very creative,&nbsp;picks up projects and spontaneous ideas all the time, (will forget them two seconds later). will probably try showing you off</p><p><b>Taurus</b>: their attention to material things isn’t necessarily related to money, mostly sentiment. likely to collect things, like shells or coins. can find beauty in almost anything. will appreciate gifts that come in paper form that they can keep, like letters and cards. stubbornness and jealousy is only rooted in things they genuinely care about, even if it seems frivolous</p><p><b>Gemini</b>: really talented, really annoyingly aware of it. genuine affection and care should be obvious because it will be quieter and shyer. keep larger social circles not necessarily out of boredom, but because they are more likely to recognize different qualities in all people to learn from. forgetful, but they’ll feel bad about it. you’re getting mixed signals? they have mixed feelings</p><p><b>Cancer</b>: not as insanely 24/7 emotional and deep as everyone seems to believe. appreciates goofy jokes, probably likes puns. does take awhile to open up themselves, but will listen to you deeply regardless of familiarity. will occasionally take random risks and just fucking surprise you. fairly impatient, but <i>will</i> wait things out if it means avoiding conflict</p><p><b>Leo</b>: knows they get mad over silly things. will do it anyway. loyal to a fault, will ignore logic to side with their loved ones. appreciates small gestures, contrary to popular belief. takes both compliments and criticism to heart; they <i>will</i> remember them. will hype you up like no one else. probably ambiverted. can stay indoors with you and watch movies <i>or</i> jump in a spontaneous roadtrip</p><p><b>Virgo: </b>cries over the weirdest movies, and probably a dove advertisement at least once. keeps journals. asks about specific schedules and movements in people’s days not to be intrusive, but because it’s how they process their own. the person who knows the answer in class but will not say it. thinks they can “fix” you in small ways, like how much coffee you drink or when you go to sleep. will feel illogically helpless if they fail</p><p><b>Libra: </b>best at hiding how much they dont know what the fuck theyre doing. will say something very wrong, so confidently, you start to believe them. their loved ones &gt; their job. randomly will be vulnerable with you after hours of joking around, for no apparent reason. indecisive <i>until</i> the decision is actually made. will stick to it unconditionally afterwards</p><p><b>Scorpio</b>: jeaaaalous, but wont show you. bizarrely good cooks, and overall naturally talented at things they probably aren’t aware of. enjoys making routines, but won’t be insanely bothered if broken. only seriously angered if lied to. will set a goal and keep it, quietly, and you may literally never know even if under the same roof</p><p><b>Sagittarius</b>: will question you about things that are important for them to know disguised as casual conversation. complete goofballs, and will do a 180 randomly in the middle of talking and become jesus incarnate, spewing philosophical views on the world and humanity. ask them what they dreamed about last night for a trip</p><p><b>Capricorn</b>: commitment who? for some reason has a knack for finding cool places to eat. works hard because they’re passionate about the thing they’re working on, otherwise no energy is devoted. actually immensely friendly, not just closed off bookworms. will agree with everyone in a group conversation not because they’re indecisive but because they understand the intention of people’s truths</p><p><b>Aquarius</b>: independent, but cannotcannotcannot feel left out or like a third wheel. all weirdly emit the same vibe even if different in actuality. actually really emotional, but will insist they’re head over heart. they have the prettiest fucking eyes. quite theatrical, enjoys feeling like a protagonist.</p><p><b>Pisces</b>: biiig gossips, but quick to change their opinions of you if you prove them wrong. will apologize, profusely. find their spotify account if you want to know how they’re feeling. not <i>great</i> at hiding their feelings, but they’re not usually trying too hard. most likely to stick around with you even if you fuck up, but not complete pushovers. capable of easily recognizing fake intentions</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276679910277120/the-signs-as-i-know-them"},{"originalPostURL":"https://watcherspet.tumblr.com/post/172328986893","postBodyContent":"\n                                                                    <p></p><blockquote><p> Let me clear this up for you. We’re mortal enemies. We don’t get time-outs.<br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276677114724352/watcherspet-let-me-clear-this-up-for-you-were"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276674289942528"},{"originalPostUsername":"ogg-steven","postBodyContent":"\n                                                                    <p>Right. She’s a reincarnated princess, and I’m a warrior for God.<br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276671547899904/ogg-steven-right-shes-a-reincarnated-princess"},{"originalPostURL":"https://dailyavengers.tumblr.com/post/173804066523","postBodyContent":"\n                                                                    <p><a href=\"http://shuris-udaku.tumblr.com\">#give her a break</a>&nbsp;<a href=\"http://shuris-udaku.tumblr.com\">#she’s surrounded by idiots #but it’s her idiots</a></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276668805808128/dailyavengers-give-her-a-break-shes-surrounded"},{"originalPostUsername":"allthesweetness","postBodyContent":"\n                                                                    <p><small>Rihanna | Vogue Arabia </small><br></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276666053361664/allthesweetness-rihanna-vogue-arabia"},{"originalPostURL":"https://magnusthemes.tumblr.com/post/131421937375","postBodyContent":"\n                                                                    <p><b>Theme - Midnight Sun;&nbsp;</b>[<a href=\"http://magnusstaticz.tumblr.com/05midnightsun\">preview</a>] [<a href=\"https://href.li/?http://pastebin.com/Nwr1rw9q\">code</a>] [<a href=\"http://magnusthemes.tumblr.com/\">magnusthemes</a>]</p><pre>Dual-sidebar one-column theme, ft. Mirio &amp; Izuku from <i>My Hero Academia</i>. (updated)</pre><p><i>Features:</i></p><ul><li>Optimized for Chrome, 1920x1080 resolution<br></li><li>Pagination/Infinite scrolling/manual load</li><li>1 column 250/300/350/400/500/540px posts</li><li>Optional fading/monochrome images</li><li>Optional show captions/tags</li><li>Optional updates box &amp; stats panel</li><li>Optional custom pixel above the sidebar image</li></ul><p><i>Notes:</i></p><ul><li>Sidebar image is 170px in width.<br></li><li>Please <b>do not</b> use the graphics in the preview for your own blogs.</li><li>Preview sidebar is by <a href=\"http://kourai.tumblr.com/post/160590028962\">kourai</a>, icon is by <a href=\"http://tomura.tumblr.com/icons\">tomura</a>.</li><li>Manual load only works if you have infinite scroll turned on.</li><li>How to add links: create a page on your blog, then click&nbsp;“show a link to this page”. Page will then automatically be added to menu.</li><li><a href=\"http://magnusthemes.tumblr.com/credits\">Full list of credits can be found here</a></li></ul><p>Please like and/or reblog the post if you use or plan to use this theme, or just if you like it! Only message me with questions <b>after</b> you’ve read the FAQ, thank you! (:</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276663289364480/magnusthemes-theme-midnight-sun-preview"},{"originalPostURL":"https://friendlyhoodspiderman.tumblr.com/post/171392137558","postBodyContent":"\n                                                                    <p><small><a href=\"https://href.li/?https://www.instagram.com/p/BfwYrkPh0ZE/?taken-by=rizahmed\">Buzzing from my first trip to Pakistan in 13yrs. I’ll be posting photos / videos / impressions from this amazing country over the next week. Stay tuned…</a></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276660536852480/friendlyhoodspiderman-buzzing-from-my-first-trip"},{"originalPostUsername":"samwinchestersource","postBodyContent":"\n                                                                    <p></p><blockquote><div><small>I was just going to college. It was Dad who said if I was gonna go I should stay gone. And that’s what I’m doing.</small></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276657766432768/samwinchestersourcei-was-just-going-to-college"},{"originalPostURL":"https://thorsodinson.tumblr.com/post/148902305746","postBodyContent":"\n                                                                    <p><small>You must not let anyone define your limits because of where you come from. Your only limit is your soul.</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/716276655019229184/thorsodinson-you-must-not-let-anyone-define-your"}]