[{"originalPostURL":"https://youngblackandvegan.tumblr.com/post/154528982690","postBodyContent":"\n                                                                        <p>When people tell stories about how their parents beat them, it’s always interesting to see their face change because they expected me to say “me too lol” but I instead say “I’m really sorry. You didn’t deserve that”<br>\nLast time a co worker who also has West Indian parents was telling me in a joking way how he remembers being beaten with a belt because lied about his report card. As he was laughing it off and saying he deserved it, I just said “wow that’s awful hun. You didn’t deserve that.” And his whole face changed. Like it hadn’t occurred to him that it’s messed up that a part of remembering his childhood is remembering how badly it hurt to be beaten so badly at such a young age. <br>\nAnother time I had a friend, non West Indian parents, who talked about how she made a mess on a dress that her parents got her. It was really expensive apparently and she spilled red juice on it. She talked about how she was ordered to take the dress of and was beaten with a belt too without any clothes on. And she was laughing and said “I was a bad ass kid lol” and I said “no hun you were just a kid”. And she looked at me and immediately stopped laughing and just sat there like “yea…I was just a kid. I don’t know why they did that to me”<br>\nMy mom was raised in a household where she was beaten so badly….I just don’t understand how she is so loving now growing up in a home where she got so little love. They called it discipline, but once she became a social worker she began to see that it was abuse. That she grew up terrified of her parents, although they thought it was respect that my mom felt. It was fear. <br>\nWe have to get comfortable challenging what is often seen as cultural norms. We have to be a generation of people who are not ashamed to say “I would never beat my child”.</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343066764312576/youngblackandvegan-when-people-tell-stories-about"},{"originalPostUsername":"wetpinkorthodoxy","postBodyContent":"\n                                                                        <p>I fucking hate it when I’m scrolling through a good blog thinking “hmm might follow this” and then I see that ridiculous post whitesplaining to black Americans that racism is “different” in Europe and that white people can be victims of racism here. </p><p>No. We’re not. White people from Poland and Romania and other countries can be victims of xenophobia.  People of colour are victims of racism. And racism in the UK looks much like racism in America - we have police brutality against black people, a disproportionate amount of black people in prison, Islamophobic hate crime, lack of POC representation in our media, a disproportionate amount of POCs living in poverty and all the rest of it. </p><p>White people are not victims of racism. We can be victims of xenophobic hate crime, xenophobic discrimination and xenophobic legislation but we will never ever be victims of racism. </p><p>And you can sit there and shrug and say “meh same difference” but it fucking matters. It matters because white people are responsible for racism whether we like it or not. We all benefit from white privilege and we’re all complicit to varying degrees. When people blur the lines between racism and xenophobia, it leads to the fallacy that anyone can be a victim of racism, which means nobody is really responsible and nobody has any particular obligation to examine their thoughts and actions. </p><p>Xenophobia is dangerous and life threatening and oppressive. We don’t have to mislabel it as racism to understand that. Racism and xenophobia have separate histories and separate causes. It’s not difficult to learn the difference. </p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343064077811712/wetpinkorthodoxy-i-fucking-hate-it-when-im"},{"originalPostURL":"https://lila-bean.tumblr.com/post/126716186780","postBodyContent":"\n                                                                    <p>@ stydia just loVE EACH OTHER LIKE I ALREADY KNOW YOU DO :’(<br></p><p><a href=\"https://href.li/?http://cdn.mtlblog.com/uploads/2013/12/PHOTO-Sander-Taats-couple-winter-snowing-3.jpg\">ref</a></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343061407072256/lila-bean-stydia-just-love-each-other-like-i"},{"originalPostURL":"https://evahns.tumblr.com/post/147576551808","postBodyContent":"\n                                                                    <p></p><p><small><b>MOODBOARD</b>: <i>ginny weasley</i></small></p><blockquote><p><small>“yeah, size is no guarantee of power,” said george. <b>“<i>look at ginny</i>.”</b></small></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343041043726336/evahns-moodboard-ginny-weasley-yeah-size-is"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343037614931968"},{"originalPostURL":"https://gravitywon.tumblr.com/post/154606135196","postBodyContent":"\n                                                                    <p><small>Daveed Diggs as <b><a href=\"http://gravitywon.tumblr.com/tagged/blackishedit\">Johan</a></b> in <i>Black-ish</i></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343025780621312/gravitywon-daveed-diggs-as-johan-in-black-ish"},{"originalPostURL":"https://driacomalfoy.tumblr.com/post/152422914120","postBodyContent":"\n                                                                    <p></p><blockquote><p><b><a href=\"http://driacomalfoy.tumblr.com/tagged/hp-female\">Harry Potter female characters</a> ➩ <i>Susan Bones</i></b><br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343023027093505/driacomalfoy-harry-potter-female-characters"},{"originalPostUsername":"buckkeybarnes","postBodyContent":"\n                                                                        <p>Admit it. We’ve all watched slightly questionable movies and tv shows just because our favourite actors were in it for .03 seconds</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343020258934784/thetorontokid-buckkeybarnes-admit-it-weve"},{"originalPostURL":"https://jaclcfrost.tumblr.com/post/154148317128","postBodyContent":"\n                                                                        <p>“what have you been up to lately?” nothing much just decaying on an emotional/mental level &amp; physical one as well, more and more, every day</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343017488580608/jaclcfrost-what-have-you-been-up-to-lately"},{"originalPostUsername":"aisforawkwardd","postBodyContent":"\n                                                                        <p>I wanna see more headcanons/fics about Hazel adjusting to the 21st century. Not so much in the technology aspect but in the social aspect. Keep in mind she lived in the 1940s. BEFORE THE CIVIL RIGHTS MOVEMENT. Like we know she had to go to a segregated school and everything, but we never get to see her reaction to how times have changed. For example:</p><ul><li>Hazel asking where the bathrooms for colored people are and Nico having to explain that they aren’t segregated anymore<br></li><li>Hazel being surprised at how nice Percy and Jason are to her because in her time white boys generally didn’t acknowledge black girls. Especially not politely.&nbsp;</li><li>The Seven stopping at a restaurant&nbsp;to get something to eat and Hazel being reluctant to go through the front door. At first, everyone is confused but then Annabeth catches on and assures Hazel that the restaurant&nbsp;won’t refuse to serve her</li><li>Hazel finding out about America’s first African American President and FLIPPING OUT</li><li>Frank showing her MLK’s&nbsp;“I Have a Dream” speech and Hazel tearing up at it</li></ul><p>LIKE SERIOUSLY I WANT THESE ISSUES ADDRESSED</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717343014742360064/okay-but-for-real-though"}]