[{"originalPostURL":"https://itwasyouu.tumblr.com/post/149913251485","postBodyContent":"\n                                                                    <p></p><blockquote><p><i>Anakin &amp; Padme - Now we are one.&nbsp;</i></p><p><i><b>by&nbsp;<a href=\"https://href.li/?http://zephiriss.deviantart.com/art/Now-we-are-one-71099892\">\n\nZephiriss</a></b></i></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601097781542912/itwasyouu-anakin-padme-now-we-are-one"},{"originalPostURL":"https://i-was-already-yours.tumblr.com/post/121262805911","postBodyContent":"\n                                                                    <p></p><ul><li><i>a character you love who gets hate for (even rightly) opposing a fandom favorite</i></li></ul><blockquote><div><b>katherine pierce</b> <i>!s1s2!</i> <i>(The Vampire Diaries)</i></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601095026884608/i-was-already-yours-a-character-you-love-who"},{"originalPostURL":"https://elisabetholsen.tumblr.com/post/165129272735","postBodyContent":"\n                                                                    <p> <small> Tony Stark <a href=\"http://tonystarkz.tumblr.com/tagged/**\">+</a> looking&nbsp;sad and detached </small> </p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601092280745984/elisabetholsen-tony-stark-looking-sad-and"},{"originalPostURL":"https://smlfoy.tumblr.com/post/164905346036","postBodyContent":"\n                                                                    <p></p><p><b>ravenclaw aesthetic\n\n→ 1/?</b></p><blockquote><p><i>for dear <a class=\"tumblelog\" href=\"https://tmblr.co/m5ubi2cSkOcUX1_m5DDqzYA\">@charlotteweasley</a><br>happy early birthday, love!&nbsp;</i></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601086832328704/smlfoy-ravenclaw-aesthetic-1-for-dear"},{"originalPostURL":"https://caribbritchick.tumblr.com/post/151685874990","postBodyContent":"\n                                                                        <p>1. Don’t waste time being fearful: go for that job that you’re certain you’re not gonna get. What’s the worse that can happen? You are rejected, but you gain interview experience. Self-doubt is really a waste of time.</p><p>2. Live in the present. Yes, it is important to plan for the future, but it is easy to put off living until it is too late. Make sure that you have no regrets about what you should have done. Do one exciting thing per year.</p><p>3. Know your worth. This applies to both work and relationships; never sell yourself short. No job or romance is more important than your self respect. Also, charge for any unique skills/services that you can offer.&nbsp;</p><p>4. Don’t be afraid to leave bad situations. I left a stable but draining teaching job in order to protect my mental health. Even though this was a big risk, it was the best decision I ever made. NOTHING is more important than your mental health.&nbsp;</p><p>5. Most 20 somethings feel that they are underachieving. This is normal - especially in today’s financial climate. Don’t feel bad if you are still living at home and cannot afford to rent/buy. I’m 30 and still living at home, saving to buy.</p><p>6. People will disappoint you, but most of the time, it’s not about you. Everybody has their own demons and traumas that make them behave in certain ways. If somebody disrespects you, assert your boundaries and keep it moving. Also, examine if there was anything you could have done to avoid the situation. But DO NOT let it eat away at you.</p><p>7. In love, nobody owes you anything. Even if they made a promise, they are their own person…Everybody has the right to change their mind and to leave a situation which is not beneficial for them. This is hurtful and hard to accept, but it is the truth.</p><p>8. Learn to enjoy your own company. Your 20s can be a lonely time as your social sphere narrows, due to employment, finances and exhaustion. Use this time to find out more about yourself and do the things that you enjoy. There is something liberating about eating at a restaurant alone.&nbsp;</p><p>9. Be kind, don’t gossip or overshare. I am still working on this one. It is really difficult to be kind and positive in a world full of annoying people. However, your attitude will influence how you are being perceived. If you are unkind, people will laugh at your jokes but they will never trust you. They will never trust you not to treat them as you treat other people. Remove yourself from toxic people, and only share negativity (sadness/anger/depression) with a therapist and one other person that you trust. If you overshare negative feelings, you may be stereotyped as being full of drama. Furthermore, people will want you to stay in a negative place because it’s entertaining and makes them feel better about their own lives. Just don’t do it.<br></p><p>10. You cannot win every battle. Within conflict, it is tempting to try to force others to agree with your perspective. However, most people are set in their ways, and find it difficult to change their views and behaviours. This is especially important when dealing with toxic family members. You may never get the apology and empathy that you seek, so it is important to accept that every battle cannot be won, and gain validation internally, rather than externally. \n\n<br></p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601084115402752/advice-for-people-in-their-20s-from-someone-whos"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601081387008000"},{"originalPostURL":"https://khanos.tumblr.com/post/143952695511","postBodyContent":"\n                                                                        <p>there’s a future version of me who’s proud I was strong enough</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601078706946048/kittehinfurs-khanos-theres-a-future-version"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601076023607296"},{"originalPostURL":"https://tianasweets.tumblr.com/post/164903330861","postBodyContent":"\n                                                                    <p></p><blockquote><div><small>\n\nSmall things become big. Winter turns to spring. One thing always changes into another.\n\n<br></small></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601073336074240/tianasweets-small-things-become-big-winter"},{"originalPostURL":"https://loga-boga.tumblr.com/post/163910875142","postBodyContent":"\n                                                                    <p></p><blockquote><p><small><i>\n\n I’m a big deal in the Resistance. Which puts a real target on my back. Are there any conspirators here? Like, First Order sympathizers?\n\n</i></small><br></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/717601070659108864/loga-boga-im-a-big-deal-in-the-resistance"}]