[{"originalPostURL":"https://13chancess.tumblr.com/post/161001332781","postBodyContent":"\n                                                                        <p>push yourself to get up before the rest of the world - start with 7am, then 6am, then 5:30am. go to the nearest hill with a big coat and a scarf and watch the sun rise.</p><p> push yourself to fall asleep earlier - start with 11pm, then 10pm, then 9pm. wake up in the morning feeling re-energized and comfortable. </p><p>get into the habit of cooking yourself a beautiful breakfast. fry tomatoes and mushrooms in real butter and garlic, fry an egg, slice up a fresh avocado and squirt way too much lemon on it. sit and eat it and do nothing else. </p><p> stretch. start by reaching for the sky as hard as you can, then trying to touch your toes. roll your head. stretch your fingers. stretch everything.</p><p> buy a 1L water bottle. start with pushing yourself to drink the whole thing in a day, then try drinking it twice.</p><p>buy a beautiful diary and a beautiful black pen. write down everything you do, including dinner dates, appointments, assignments, coffees, what you need to do that day. no detail is too small.</p><p>strip your bed of your sheets and empty your underwear draw into the washing machine. put a massive scoop of scented fabric softener in there and wash. make your bed in full.</p><p>organise your room. fold all your clothes (and bag what you don’t want), clean your mirror, your laptop, vacuum the floor. light a beautiful candle.</p><p> have a luxurious shower with your favourite music playing. wash your hair, scrub your body, brush your teeth. lather your whole body in moisturiser, get familiar with the part between your toes, your inner thighs, the back of your neck.</p><p>push yourself to go for a walk. take your headphones, go to the beach and walk. smile at strangers walking the other way and be surprised how many smile back. bring your dog and observe the dog’s behaviour. realise you can learn from your dog.</p><p>message old friends with personal jokes. reminisce. suggest a catch up soon, even if you don’t follow through. push yourself to follow through.</p><p> think long and hard about what interests you. crime? sex? boarding school? long-forgotten romance etiquette? find a book about it and read it. there is a book about literally everything. </p><p>become the person you would ideally fall in love with. let cars merge into your lane when driving. pay double for parking tickets and leave a second one in the machine. stick your tongue out at babies. compliment people on their cute clothes. challenge yourself to not ridicule anyone for a whole day. then two. then a week. walk with a straight posture. look people in the eye. ask people about their story. talk to acquaintances so they become friends.</p><p> lie in the sunshine. daydream about the life you would lead if failure wasn’t a thing. open your eyes. take small steps to make it happen for you.</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962759097368576/monsieurenjlolras-13chancess-push-yourself-to"},{"originalPostURL":"https://scottmcperfect.tumblr.com/post/165713756403","postBodyContent":"\n                                                                        <p>we never once deserved scott mccall but I’m so glad we had him</p>\n                                                                    ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962756348035072/scottmcperfect-we-never-once-deserved-scott"},{"originalPostUsername":"queercelebs","postBodyContent":"\n                                                                    <p></p><blockquote><div><small><b>Stephanie Beatriz </b>by <i>Maggie West</i>.<b> </b><br></small></div></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962753631223808/queercelebsstephanie-beatriz-by-maggie-west"},{"originalPostURL":"https://neddstark.tumblr.com/post/169085230035","postBodyContent":"\n                                                                    <p><small>Episode IV - A New Hope (1977) // The Force Awakens (2015)</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962750939512832/neddstark-episode-iv-a-new-hope-1977-the"},{"originalPostURL":"https://crownsofnarnia.tumblr.com/post/142126270393","postBodyContent":"\n                                                                    <p></p><blockquote><p><i><small>“<a href=\"https://href.li/?https://www.fanfiction.net/s/4045388/1/Passing-Down-the-Crown\">How</a>…how can he be king over kings that came before him?” asked the prince, confounded.&nbsp;<br></small></i></p><p><i><small>I grinned at the gentle, long-standing joke my siblings and I shared. “I was king before Peter was, Caspian.”<br></small></i></p><p><i><small>There was a long silence, and then Caspian made a little sound of,&nbsp;“Oh!” that told me he, like so many people, had assumed that Peter had been crowned first and derived his authority from his age and rank. He had not. <b>Lucy was the first of us to enter Narnia and she was the first of us to be crowned, as was fitting.</b></small></i></p></blockquote>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962748226781184/crownsofnarnia-howhow-can-he-be-king-over"},{"originalPostUsername":"","postBodyContent":"","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962745499500544"},{"originalPostURL":"https://jamesemcgraw.tumblr.com/post/166055328737","postBodyContent":"\n                                                                    <p><small><i>You say this as if it is certain.</i></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962742791028736/jamesemcgraw-you-say-this-as-if-it-is-certain"},{"originalPostURL":"https://karlmordo.tumblr.com/post/169846157910","postBodyContent":"\n                                                                    <p><small>There was a period when I had a hard time reconciling all the different parts of me in a way that I thought would make sense to others.<br><br></small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962740051099648/karlmordo-there-was-a-period-when-i-had-a-hard"},{"originalPostURL":"https://bensolcs.tumblr.com/post/149617896783","postBodyContent":"\n                                                                    <p><small>It is a dark time for the Rebellion. Although the Death Star has been destroyed, Imperial troops have driven the Rebel forces from their hidden base and pursued them across the galaxy. Evading the dreaded Imperial Starfleet, a group of freedom fighters led by Luke Skywalker has established a new secret base on the remote ice world of Hoth. The evil lord Darth Vader, obsessed with finding young Skywalker, has dispatched thousands of remote probes into the far reaches of space…</small></p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962737368760320/bensolcs-it-is-a-dark-time-for-the-rebellion"},{"originalPostURL":"https://sapphicpjo.tumblr.com/post/161563181411","postBodyContent":"\n                                                                    <p>i don’t have a caption for this but hazel is a lesbian and i love her :/</p>\n                                                                ","rebloggedPostURL":"https://getbacktofandomlife.tumblr.com/post/719962734684454913/sapphicpjo-i-dont-have-a-caption-for-this-but"}]